MyHome/src/Catalogs/мх_ВнешниеСистемы/мх_ВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мх_ВнешниеСистемы</name>
  <predefined>
    <items>
      <name>ЛичныйКабинетТинькофф</name>
      <description>Личный кабинет тинькофф</description>
    </items>
  </predefined>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>800</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тинькофф_wuid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тинькофф_ИдентификаторСессии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тинькофф_ИдентификаторПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

MyHome/src/CommonModules/мх_ИнтеграцияТинькоффВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьЗначениеНастройкиВнешнейСистемы(Настройка, ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	мх_ИнтеграцияТинькофф.УстановитьЗначениеНастройкиВнешнейСистемы(Настройка, ИмяРеквизита, ЗначениеРеквизита);
	
КонецПроцедуры

Функция БазовыйАдресРесурсаАпи() Экспорт   
	
	Настройка = ПредопределенноеЗначение("Справочник.мх_ВнешниеСистемы.ЛичныйКабинетТинькофф");
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Настройка, "АдресРесурса");
	
КонецФункции    

Функция ПараметрыПодключенияКЛичномуКабинету(Настройка) Экспорт
	
	ТребуемыеПараметры = "Сервер, АдресРесурса, ЗащищенноеСоединение, Телефон, Пользователь, Пароль,
						|Тинькофф_wuid, Тинькофф_ИдентификаторСессии, Тинькофф_ИдентификаторПользователя";
	
	Возврат мх_ИнтеграцияСВнешнимиСистемамиПовтИсп.ДанныеВнешнейСистемы(Настройка, ТребуемыеПараметры, Истина);
	
КонецФункции

Функция КодироватьСтрокуДляURL(Данные) Экспорт
	
	Возврат КодироватьСтроку(Данные, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции      

Функция РаскодироватьСтрокуДляURL(Данные) Экспорт
	
	Возврат РаскодироватьСтроку(Данные, СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#КонецОбласти
